Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [24]:
group=df.groupby("Age")
mean=group.mean()
mean.head(2)

/tmp/ipykernel_253/3375061169.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  mean=group.mean()

      PassengerId  Survived  Pclass  SibSp  Parch     Fare
Age
0.42        804.0       1.0     3.0    0.0    1.0   8.5167
0.67        756.0       1.0     2.0    1.0    1.0  14.5000

In [45]:
fill=df.fillna("N/A")

In [46]:
fill.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,N/A,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,N/A,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,N/A,S

In [32]:
sort=df.sort_values(by='PassengerId',ascending=False)

In [34]:
sort.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C

In [35]:
duplicate=df.drop_duplicates()

In [37]:
duplicate.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [41]:
value_count=df["Age"].value_counts()

In [43]:
value_count.head()

24.0    30
22.0    27
18.0    26
19.0    25
28.0    25
Name: Age, dtype: int64

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [77]:
data={"A":[7,4,6,7,7,8,8,8,8,6,3],
      "B":[3,3,5,6,8,9,9,7,6,5,4],
      "C":[3,6,7,6,1,2,2,3,4,5,3]}

In [78]:
df=pd.DataFrame(data)

In [79]:
df

    A  B  C
0   7  3  3
1   4  3  6
2   6  5  7
3   7  6  6
4   7  8  1
5   8  9  2
6   8  9  2
7   8  7  3
8   8  6  4
9   6  5  5
10  3  4  3

In [82]:
def reindex_data(df):
    new_df=pd.RangeIndex(start=1,stop=df.shape[0]*2,step=2)
    return df.set_index(new_df)
reindex_data(df)

    A  B  C
1   7  3  3
3   4  3  6
5   6  5  7
7   7  6  6
9   7  8  1
11  8  9  2
13  8  9  2
15  8  7  3
17  8  6  4
19  6  5  5
21  3  4  3

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [21]:
data={"values":[10, 20, 30, 40, 50]}

In [22]:
df=pd.DataFrame(data)

In [23]:
df

   values
0      10
1      20
2      30
3      40
4      50

In [6]:
df[0:3].sum()

values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [16]:
data={"Text":["sweet Mango", "apple","banana","blueberry"]}

In [17]:
df=pd.DataFrame(data)

In [18]:
df

          Text
0  sweet Mango
1        apple
2       banana
3    blueberry

In [19]:
def count_words(text):
    words=text.split()
    return len(words)

df['Word_Count']=df['Text'].apply(count_words)

In [20]:
df

          Text  Word_Count
0  sweet Mango           2
1        apple           1
2       banana           1
3    blueberry           1

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in the DataFrame. This is equal to the product of the number of rows and columns in the DataFrame.

DataFrame.shape() returns a tuple that contains the number of rows and columns in the DataFrame. The first element of the tuple represents the number of rows, and the second element represents the number of columns.

In [27]:
df=pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

In [28]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [30]:
df.size

9

In [31]:
df.shape

(3, 3)

Q6. Which function of pandas do we use to read an excel file?

read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [48]:
data={'Email':["john.deo@gmail.com","example@gmail.com","test@gmail.com"]}

In [49]:
df=pd.DataFrame(data)

In [50]:
df

                Email
0  john.deo@gmail.com
1   example@gmail.com
2      test@gmail.com

In [44]:
def extract(Email):
    user=Email.split("@")[0]
    return user

In [45]:
df['Username']=df['Email'].apply(extract)

In [46]:
df

                Email  Username
0  john.deo@gmail.com  john.deo
1   example@gmail.com   example
2      test@gmail.com      test

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [52]:
data={'A':[3,8,6,2,9],
     'B':[5,2,9,3,1],
     'C':[1,7,4,5,2]}

In [53]:
df=pd.DataFrame(data)

In [54]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [64]:
def sort_value(df):
    result=df[(df['A']>5) & (df['B']<10)]
    return result
sort_value(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [65]:
data={"values":[10, 20, 30, 40, 50,80,90]}

In [66]:
df=pd.DataFrame(data)

In [67]:
df

   values
0      10
1      20
2      30
3      40
4      50
5      80
6      90

In [79]:
def calculation(df):
    mean=df['values'].mean()
    median=df['values'].median()
    stdevi=df['values'].std()
    return mean,median,stdevi
mean,median,stdevi=calculation(df)
print('Mean:', mean)
print('Median:', median)
print('Standard deviation:', stdevi)

Mean: 45.714285714285715
Median: 40.0
Standard deviation: 29.920529661723826

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [80]:
import pandas as pd
import numpy as np

In [84]:
dates=pd.date_range('2023-01-01',periods=15)
sales=np.random.randint(10,100,size=15)
df=pd.DataFrame({"Sales":sales,"Date":dates})
df

    Sales       Date
0      14 2023-01-01
1      11 2023-01-02
2      65 2023-01-03
3      97 2023-01-04
4      20 2023-01-05
5      56 2023-01-06
6      39 2023-01-07
7      66 2023-01-08
8      72 2023-01-09
9      42 2023-01-10
10     60 2023-01-11
11     59 2023-01-12
12     34 2023-01-13
13     48 2023-01-14
14     78 2023-01-15

In [86]:
def moving_avg(df):
    avg=df['Sales'].rolling(window=7,min_periods=1).mean()
    return avg

In [89]:
df['MovingAverage']=moving_avg(df)

In [90]:
df

    Sales       Date  MovingAverage
0      14 2023-01-01      14.000000
1      11 2023-01-02      12.500000
2      65 2023-01-03      30.000000
3      97 2023-01-04      46.750000
4      20 2023-01-05      41.400000
5      56 2023-01-06      43.833333
6      39 2023-01-07      43.142857
7      66 2023-01-08      50.571429
8      72 2023-01-09      59.285714
9      42 2023-01-10      56.000000
10     60 2023-01-11      50.714286
11     59 2023-01-12      56.285714
12     34 2023-01-13      53.142857
13     48 2023-01-14      54.428571
14     78 2023-01-15      56.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [120]:
df=pd.DataFrame({'Date':pd.date_range('2023-03-01',periods=10)})

In [121]:
df

        Date
0 2023-03-01
1 2023-03-02
2 2023-03-03
3 2023-03-04
4 2023-03-05
5 2023-03-06
6 2023-03-07
7 2023-03-08
8 2023-03-09
9 2023-03-10

In [124]:
def add_weekday(df):
    df['Weekday']=df['Date'].dt.day_name()
    return df
df['Date']=pd.to_datetime(df['Date'])
print(add_weekday(df))

        Date    Weekday
0 2023-03-01  Wednesday
1 2023-03-02   Thursday
2 2023-03-03     Friday
3 2023-03-04   Saturday
4 2023-03-05     Sunday
5 2023-03-06     Monday
6 2023-03-07    Tuesday
7 2023-03-08  Wednesday
8 2023-03-09   Thursday
9 2023-03-10     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [137]:
df = pd.DataFrame({'Date': ['2022-12-12','2023-01-01', '2023-01-15', '2023-01-31', '2023-02-14']})

In [138]:
df

         Date
0  2022-12-12
1  2023-01-01
2  2023-01-15
3  2023-01-31
4  2023-02-14

In [145]:
def select_row(df):
    df['Date']=pd.to_datetime(df['Date'])
    rows=(df['Date']>='2023-01-01') & (df['Date']<='2023-01-31')
    dates=df.loc[rows]
    return dates

In [146]:
select_row(df)

        Date
1 2023-01-01
2 2023-01-15
3 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

The first and foremost library that needs to be imported to use the basic functions of pandas is pandas itself.